In [1]:
# Importing libraries
import pandas as pd
import numpy as np

## Task 1 - Create DataFrames and Save as CSV

In [30]:
# Create a dictionary with employee data
employee_data = {
    'ID': ['A001','A002','A003','A004','A005'],                 # Employee IDs
    'Name': ['John Alter','Alice Luxumberg','Tom Sabestine',    # Full names
             'Nina Adgra','Amy Johny'],
    'Gender': ['M','F','M','F','F'],                            # Gender
    'City': ['Paris','London','Berlin','Newyork','Madrid'],     # City
    'Age': [25,27,29,31,30]                                     # Age
}

# Convert the dictionary into a pandas DataFrame
df_employee = pd.DataFrame(employee_data)

# Save the DataFrame to a CSV file named "employee.csv"
# index=False → ensures row numbers (0,1,2..) are NOT written to the file
df_employee.to_csv('employee.csv', index=False)

# Display the DataFrame in Jupyter
df_employee

     ID             Name Gender     City  Age
0  A001       John Alter      M    Paris   25
1  A002  Alice Luxumberg      F   London   27
2  A003    Tom Sabestine      M   Berlin   29
3  A004       Nina Adgra      F  Newyork   31
4  A005        Amy Johny      F   Madrid   30

In [31]:
# Create a dictionary with employee seniority levels
seniority_data = {
    'ID': ['A001','A002','A003','A004','A005'],   # Employee IDs
    'Designation Level': [2,2,3,2,3]              # Their current designation levels
}

# Convert dictionary to DataFrame
df_seniority = pd.DataFrame(seniority_data)

# Save to CSV
df_seniority.to_csv('seniority.csv', index=False)

# Display DataFrame
df_seniority

     ID  Designation Level
0  A001                  2
1  A002                  2
2  A003                  3
3  A004                  2
4  A005                  3

In [32]:
# Create a dictionary with project details
project_data = {
    'ID': ['A001','A002','A003','A004','A005','A002','A005','A003','A001','A003','A001','A004','A004','A005'], # Employee IDs
    'Project': ['Project 1','Project 2','Project 3','Project 4','Project 5',
                'Project 6','Project 7','Project 8','Project 9','Project 10',
                'Project 11','Project 12','Project 13','Project 14'],          # Project names
    'Cost': [1002000,2000000,4500000,5500000,None,680000,400000,350000,        # Project costs (some missing = None)
             None,300000,2000000,1000000,3000000,200000],
    'Status': ['Finished','Ongoing','Finished','Ongoing','Finished',
               'Failed','Finished','Failed','Ongoing','Finished',
               'Failed','Ongoing','Finished','Finished']                       # Project status
}

# Convert dictionary to DataFrame
df_project = pd.DataFrame(project_data)

# Save to CSV
df_project.to_csv('project.csv', index=False)

# Display DataFrame
df_project

      ID     Project       Cost    Status
0   A001   Project 1  1002000.0  Finished
1   A002   Project 2  2000000.0   Ongoing
2   A003   Project 3  4500000.0  Finished
3   A004   Project 4  5500000.0   Ongoing
4   A005   Project 5        NaN  Finished
5   A002   Project 6   680000.0    Failed
6   A005   Project 7   400000.0  Finished
7   A003   Project 8   350000.0    Failed
8   A001   Project 9        NaN   Ongoing
9   A003  Project 10   300000.0  Finished
10  A001  Project 11  2000000.0    Failed
11  A004  Project 12  1000000.0   Ongoing
12  A004  Project 13  3000000.0  Finished
13  A005  Project 14   200000.0  Finished

## Task 2 - Replace missing Cost values with Running Average

In [33]:
# Make a copy of the 'Cost' column so we can modify it safely
costs = df_project['Cost'].copy()

# Loop through each row index in the 'Cost' column
for i in range(len(costs)):
    
    # Check if the current value is missing (NaN)
    if pd.isna(costs[i]):
        
        # Take all the values before index i → costs[:i]
        # Filter out missing values → ~pd.isna(costs[:i])
        # Compute the mean of those valid values
        costs[i] = np.mean(costs[:i][~pd.isna(costs[:i])])

# Assign the updated 'costs' back into the original DataFrame
df_project['Cost'] = costs

# Display the updated DataFrame with missing values replaced
df_project

      ID     Project       Cost    Status
0   A001   Project 1  1002000.0  Finished
1   A002   Project 2  2000000.0   Ongoing
2   A003   Project 3  4500000.0  Finished
3   A004   Project 4  5500000.0   Ongoing
4   A005   Project 5  3250500.0  Finished
5   A002   Project 6   680000.0    Failed
6   A005   Project 7   400000.0  Finished
7   A003   Project 8   350000.0    Failed
8   A001   Project 9  2210312.5   Ongoing
9   A003  Project 10   300000.0  Finished
10  A001  Project 11  2000000.0    Failed
11  A004  Project 12  1000000.0   Ongoing
12  A004  Project 13  3000000.0  Finished
13  A005  Project 14   200000.0  Finished

## Task 3 - Split Name into First Name and Last Name

In [34]:
# Split the 'Name' column into two new columns: 'First Name' and 'Last Name'
# pat=' ' → split on the first space
# n=1 → do only 1 split (so names with more than two words keep the rest in 'Last Name')
# expand=True → return separate columns instead of lists
df_employee[['First Name','Last Name']] = df_employee['Name'].str.split(pat=' ', n=1, expand=True)

# Drop the original 'Name' column since we now have First Name and Last Name separately
df_employee = df_employee.drop(columns=['Name'])

# Display the updated DataFrame
df_employee

     ID Gender     City  Age First Name  Last Name
0  A001      M    Paris   25       John      Alter
1  A002      F   London   27      Alice  Luxumberg
2  A003      M   Berlin   29        Tom  Sabestine
3  A004      F  Newyork   31       Nina      Adgra
4  A005      F   Madrid   30        Amy      Johny

## Task 4 - Join all three DataFrames

In [35]:
# First join employee and seniority data on 'ID'
# Then join the result with project data on 'ID'
df_final = df_employee.merge(df_seniority, on='ID').merge(df_project, on='ID')

# Display the combined DataFrame
df_final

,ID,Gender,City,Age,First Name,Last Name,Designation Level,Project,Cost,Status
0,A001,M,Paris,25,John,Alter,2,Project 1,1002000.0,Finished
1,A001,M,Paris,25,John,Alter,2,Project 9,2210312.5,Ongoing
2,A001,M,Paris,25,John,Alter,2,Project 11,2000000.0,Failed
3,A002,F,London,27,Alice,Luxumberg,2,Project 2,2000000.0,Ongoing
4,A002,F,London,27,Alice,Luxumberg,2,Project 6,680000.0,Failed
5,A003,M,Berlin,29,Tom,Sabestine,3,Project 3,4500000.0,Finished
6,A003,M,Berlin,29,Tom,Sabestine,3,Project 8,350000.0,Failed
7,A003,M,Berlin,29,Tom,Sabestine,3,Project 10,300000.0,Finished
8,A004,F,Newyork,31,Nina,Adgra,2,Project 4,5500000.0,Ongoing
9,A004,F,Newyork,31,Nina,Adgra,2,Project 12,1000000.0,Ongoing
10,A004,F,Newyork,31,Nina,Adgra,2,Project 13,3000000.0,Finished
11,A005,F,Madrid,30,Amy,Johny,3,Project 5,3250500.0,Finished
12,A005,F,Madrid,30,Amy,Johny,3,Project 7,400000.0,Finished
13,A005,F,Madrid,30,Amy,Johny,3,Project 14,200000.0,Finished

## Task 5 - Add Bonus Column

In [36]:
# Add a new column 'Bonus' to df_final
# For each row (x):
#   → If project Status is 'Finished', Bonus = 5% of Cost
#   → Otherwise (Ongoing/Failed), Bonus = 0
# axis=1 → apply the function row by row
df_final['Bonus'] = df_final.apply(
    lambda x: 0.05 * x['Cost'] if x['Status'] == 'Finished' else 0,
    axis=1
)

# Display the updated DataFrame
df_final

,ID,Gender,City,Age,First Name,Last Name,Designation Level,Project,Cost,Status,Bonus
0,A001,M,Paris,25,John,Alter,2,Project 1,1002000.0,Finished,50100.0
1,A001,M,Paris,25,John,Alter,2,Project 9,2210312.5,Ongoing,0.0
2,A001,M,Paris,25,John,Alter,2,Project 11,2000000.0,Failed,0.0
3,A002,F,London,27,Alice,Luxumberg,2,Project 2,2000000.0,Ongoing,0.0
4,A002,F,London,27,Alice,Luxumberg,2,Project 6,680000.0,Failed,0.0
5,A003,M,Berlin,29,Tom,Sabestine,3,Project 3,4500000.0,Finished,225000.0
6,A003,M,Berlin,29,Tom,Sabestine,3,Project 8,350000.0,Failed,0.0
7,A003,M,Berlin,29,Tom,Sabestine,3,Project 10,300000.0,Finished,15000.0
8,A004,F,Newyork,31,Nina,Adgra,2,Project 4,5500000.0,Ongoing,0.0
9,A004,F,Newyork,31,Nina,Adgra,2,Project 12,1000000.0,Ongoing,0.0
10,A004,F,Newyork,31,Nina,Adgra,2,Project 13,3000000.0,Finished,150000.0
11,A005,F,Madrid,30,Amy,Johny,3,Project 5,3250500.0,Finished,162525.0
12,A005,F,Madrid,30,Amy,Johny,3,Project 7,400000.0,Finished,20000.0
13,A005,F,Madrid,30,Amy,Johny,3,Project 14,200000.0,Finished,10000.0

## Task 6 - Demote Failed Project Heads & Drop Designation > 4

In [37]:
# Step 1: Demote employees who have FAILED projects
# For all rows where Status == 'Failed',
# increase their Designation Level by 1 (since higher number = lower position)
df_final.loc[df_final['Status'] == 'Failed', 'Designation Level'] += 1

# Step 2: Remove employees who crossed level 4
# Keep only rows where Designation Level is 4 or less
df_final = df_final[df_final['Designation Level'] <= 4]

# Display the updated DataFrame
df_final

,ID,Gender,City,Age,First Name,Last Name,Designation Level,Project,Cost,Status,Bonus
0,A001,M,Paris,25,John,Alter,2,Project 1,1002000.0,Finished,50100.0
1,A001,M,Paris,25,John,Alter,2,Project 9,2210312.5,Ongoing,0.0
2,A001,M,Paris,25,John,Alter,3,Project 11,2000000.0,Failed,0.0
3,A002,F,London,27,Alice,Luxumberg,2,Project 2,2000000.0,Ongoing,0.0
4,A002,F,London,27,Alice,Luxumberg,3,Project 6,680000.0,Failed,0.0
5,A003,M,Berlin,29,Tom,Sabestine,3,Project 3,4500000.0,Finished,225000.0
6,A003,M,Berlin,29,Tom,Sabestine,4,Project 8,350000.0,Failed,0.0
7,A003,M,Berlin,29,Tom,Sabestine,3,Project 10,300000.0,Finished,15000.0
8,A004,F,Newyork,31,Nina,Adgra,2,Project 4,5500000.0,Ongoing,0.0
9,A004,F,Newyork,31,Nina,Adgra,2,Project 12,1000000.0,Ongoing,0.0
10,A004,F,Newyork,31,Nina,Adgra,2,Project 13,3000000.0,Finished,150000.0
11,A005,F,Madrid,30,Amy,Johny,3,Project 5,3250500.0,Finished,162525.0
12,A005,F,Madrid,30,Amy,Johny,3,Project 7,400000.0,Finished,20000.0
13,A005,F,Madrid,30,Amy,Johny,3,Project 14,200000.0,Finished,10000.0

## Task 7 - Add Mr/Mrs Prefix and Drop Gender

In [38]:
# Step 1: Add a prefix to the 'First Name' column
# For each row:
#   If Gender == 'M' → prefix 'Mr. '
#   If Gender == 'F' → prefix 'Mrs. '
# axis=1 → ensures the function works row by row
df_final['First Name'] = df_final.apply(
    lambda x: ('Mr. ' if x['Gender'] == 'M' else 'Mrs. ') + x['First Name'],
    axis=1
)

# Step 2: Remove the 'Gender' column since it’s no longer needed
df_final = df_final.drop(columns=['Gender'])

# Step 3: Display the updated DataFrame
df_final

,ID,City,Age,First Name,Last Name,Designation Level,Project,Cost,Status,Bonus
0,A001,Paris,25,Mr. John,Alter,2,Project 1,1002000.0,Finished,50100.0
1,A001,Paris,25,Mr. John,Alter,2,Project 9,2210312.5,Ongoing,0.0
2,A001,Paris,25,Mr. John,Alter,3,Project 11,2000000.0,Failed,0.0
3,A002,London,27,Mrs. Alice,Luxumberg,2,Project 2,2000000.0,Ongoing,0.0
4,A002,London,27,Mrs. Alice,Luxumberg,3,Project 6,680000.0,Failed,0.0
5,A003,Berlin,29,Mr. Tom,Sabestine,3,Project 3,4500000.0,Finished,225000.0
6,A003,Berlin,29,Mr. Tom,Sabestine,4,Project 8,350000.0,Failed,0.0
7,A003,Berlin,29,Mr. Tom,Sabestine,3,Project 10,300000.0,Finished,15000.0
8,A004,Newyork,31,Mrs. Nina,Adgra,2,Project 4,5500000.0,Ongoing,0.0
9,A004,Newyork,31,Mrs. Nina,Adgra,2,Project 12,1000000.0,Ongoing,0.0
10,A004,Newyork,31,Mrs. Nina,Adgra,2,Project 13,3000000.0,Finished,150000.0
11,A005,Madrid,30,Mrs. Amy,Johny,3,Project 5,3250500.0,Finished,162525.0
12,A005,Madrid,30,Mrs. Amy,Johny,3,Project 7,400000.0,Finished,20000.0
13,A005,Madrid,30,Mrs. Amy,Johny,3,Project 14,200000.0,Finished,10000.0

## Task 8 - Promote Designation Level if Age > 29

In [39]:
# Define a function that applies promotion rules
def promote(level, age):
    # Check promotion condition:
    # If employee is older than 29 AND not already at highest rank (1)
    if age > 29 and level > 1:
        # Promote: decrease designation level by 1
        return level - 1
    else:
        # Otherwise keep the level unchanged
        return level

# Apply the promote() function row by row on df_final
# axis=1 → pass each row as input
# For each row, take Designation Level and Age and run through the function
df_final['Designation Level'] = df_final.apply(
    lambda row: promote(row['Designation Level'], row['Age']),
    axis=1
)

# Display the updated DataFrame after promotions
df_final

,ID,City,Age,First Name,Last Name,Designation Level,Project,Cost,Status,Bonus
0,A001,Paris,25,Mr. John,Alter,2,Project 1,1002000.0,Finished,50100.0
1,A001,Paris,25,Mr. John,Alter,2,Project 9,2210312.5,Ongoing,0.0
2,A001,Paris,25,Mr. John,Alter,3,Project 11,2000000.0,Failed,0.0
3,A002,London,27,Mrs. Alice,Luxumberg,2,Project 2,2000000.0,Ongoing,0.0
4,A002,London,27,Mrs. Alice,Luxumberg,3,Project 6,680000.0,Failed,0.0
5,A003,Berlin,29,Mr. Tom,Sabestine,3,Project 3,4500000.0,Finished,225000.0
6,A003,Berlin,29,Mr. Tom,Sabestine,4,Project 8,350000.0,Failed,0.0
7,A003,Berlin,29,Mr. Tom,Sabestine,3,Project 10,300000.0,Finished,15000.0
8,A004,Newyork,31,Mrs. Nina,Adgra,1,Project 4,5500000.0,Ongoing,0.0
9,A004,Newyork,31,Mrs. Nina,Adgra,1,Project 12,1000000.0,Ongoing,0.0
10,A004,Newyork,31,Mrs. Nina,Adgra,1,Project 13,3000000.0,Finished,150000.0
11,A005,Madrid,30,Mrs. Amy,Johny,2,Project 5,3250500.0,Finished,162525.0
12,A005,Madrid,30,Mrs. Amy,Johny,2,Project 7,400000.0,Finished,20000.0
13,A005,Madrid,30,Mrs. Amy,Johny,2,Project 14,200000.0,Finished,10000.0

## Task 9 - Total Project Cost per Employee

In [40]:
# Step 1: Group by employee ID and First Name, then sum the Cost of all their projects
df_TotalProjCost = df_final.groupby(['ID','First Name'])['Cost'].sum().reset_index()

# Step 2: Rename the 'Cost' column to 'Total Cost' for clarity
df_TotalProjCost.rename(columns={'Cost':'Total Cost'}, inplace=True)

# Step 3: Save the new DataFrame into a CSV file
# index=False → don’t include row numbers in the file
df_TotalProjCost.to_csv('TotalProjCost.csv', index=False)

# Step 4: Display the resulting DataFrame
df_TotalProjCost

     ID  First Name  Total Cost
0  A001    Mr. John   5212312.5
1  A002  Mrs. Alice   2680000.0
2  A003     Mr. Tom   5150000.0
3  A004   Mrs. Nina   9500000.0
4  A005    Mrs. Amy   3850500.0

## Task 10 - Employees with 'o' in City

In [41]:
# Filter rows where the 'City' column contains the letter 'o' 
df_final[df_final['City'].str.contains('o', case=False)]

,ID,City,Age,First Name,Last Name,Designation Level,Project,Cost,Status,Bonus
3,A002,London,27,Mrs. Alice,Luxumberg,2,Project 2,2000000.0,Ongoing,0.0
4,A002,London,27,Mrs. Alice,Luxumberg,3,Project 6,680000.0,Failed,0.0
8,A004,Newyork,31,Mrs. Nina,Adgra,1,Project 4,5500000.0,Ongoing,0.0
9,A004,Newyork,31,Mrs. Nina,Adgra,1,Project 12,1000000.0,Ongoing,0.0
10,A004,Newyork,31,Mrs. Nina,Adgra,1,Project 13,3000000.0,Finished,150000.0